// Sea_battle_bot.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
                     


                                                                ////// БОТ_1(ПРОТОТИП) //////
																
//////////////////////////////////////        СТРЕЛЯЕТ ПО СЛУЧАЙНОЙ ЯЧЕКЕ МАССИВА, ЕСЛИ НЕ ПОПАЛ, СТРЕЛЯЕТ ЗАНОВО       /////////////////////////////////////////////
///////////////////////////////////             КОГДА ПОПАДАЕТ ВКЛЮЧАЕТСЯ РЕЖИМ 2 И НАЧИНАЕТ СТРЕЛЯТЬ ПО РЯДУ          //////////////////////////////////////////////////
///////////////////////////////////////          ДОХОДИТ ДО КРАЯ ЗАПОЛНЕННОГО РЯДА, ПОНИМАЕТ ЧТО РЯД ЗАКОНЧИЛСЯ        /////////////////////////////////////////////
//////////////////////////////////////                      НАЧИНАЕТ СТРЕЛЯТЬ В ПРОТВОПОЛЖНУЮ СТРОНУ                       ///////////////////////////////////////
/////////////////////////////////////     ЕСЛИ ВИДИТ,ЧТО РЯДОМ НЕ МОЖЕТ БЫТЬ КОРОБЛЯ(ИЛИ ГРАНИЦА ПОЛЯ) - НЕ СТРЕЛЯЕТ         ///////////////////////////////////////////////////
//////////////////////////////////////               МАССИВ - ЭТО БУДУЮЩАЯ СТРОКА ИГРОВОГО ПОЛЯ " МОРСКОЙ БОЙ "         ////////////////////////////////////////////////
/////////////////////////////////////                            2-ПОМЕЧАЕМ ПОДБИТУЮ ПАЛУБУ                             //////////////////////////////////////////////


#include <iostream>
#include <windows.h>
#include <conio.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");
	int const size = 10;
	int mass[size] = { 0,0,1,1,1,1,0,0,0,0 };////еденицами помечены палубы 
	int live = 4;  // количество палуб(жизней)
	int mode = 0;
	int x = 0;
	int dim = 0;    // переменная напрвления

	int first_hit_x = 0; //переменная для сохранения первого случайного попадания

	do
	{
		if (mode == 0) // 1й режим случайный
		{
			x = rand() % size; //случайный выстрел

			if (mass[x] == 1) //если попали
			{
				mode = 1;      // переключаемся на режим анализа(режим 2)
				mass[x] = 2;
				first_hit_x = x;
				live--;
				cout << " ранен " << endl;
			}
			else
			{
				cout << " промазал ! " << endl;
			}
		}
	    else if (mode == 1)  // 2й режим анализа

		{
			if (dim == 0)
			{
				if (x > 0)
				{
					x--;                //ограничение выхода за пределы влево
				}
				else
				{
					dim = 1;           
					x = first_hit_x+1; // здесь не может быть корабля (вплотную)
				}
			}
			else
			{
				if (x < size - 1) // ограничение выхода за пределы вправо
				{
					x++;
				}
			}

			if (mass[x] == 1 && live>1)
			{
				mass[x] = 2;
				cout << " ранен " << endl;
				live--;
			}
			else if (mass[x] == 1 && live == 1)
			{
				mass[x] = 2;
				cout << " убит " << endl;
				mode = 0;    // переключаем в режим 1
				live = 0;
			}
			else
			{
				dim = 1;
				x = first_hit_x;
			}
		}
		for (int i = 0; i < size; i++)
		{
			cout << mass[i] << " ";
		}
		cout << endl;


	} while (live!=0);


   
}
